# HostStructuralRebar Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ReinforcementSettings..::..HostStructuralRebar Property
ReinforcementSettings Class See Also
---
Host Structural Rebar within Area and Path Reinforcement with touching AtomHostStructuralRebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool HostStructuralRebar { get; set; }
```

Visual Basic
---
```text
Public Property HostStructuralRebar As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HostStructuralRebar {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more AreaReinforcement or PathReinforcement elements. |

# See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace